# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:
# [2, 3, 4, 5, 6] => [12, 15, 16]
# [2, 3, 5, 6] => [12, 15]

def rez(s):
    n = 0
    if len(s) % 2 != 0:
        n = 1
    result = [0]*int(((len(s)+n)/2))
    for i in range(len(result)):
        result[i] = s[i]*s[-i-1]
    print(result)


rez([2, 3, 5, 6])
